/*  todo

     ======= Вход в систему =======
        Введите логин: admin
        Введите пароль: 12345

    ======= Добро пожаловать в Магазин книг =======

        1. Добавить книгу
        2. Удалить книгу
        3. Редактировать книгу
        4. Продать книгу
        5. Списать книгу
        6. Внести книгу в акцию
        7. Отложить книгу для покупателя
        8. Поиск книги
        9. Просмотреть список новинок
        10. Просмотреть список самых продаваемых книг
        11. Просмотреть список популярных авторов
        12. Просмотреть список популярных жанров
        0. Выход

        Выберите действие: 1

        ======= Добавление новой книги =======

        Введите название книги: Мастер и Маргарита
        Введите ФИО автора: Михаил Булгаков
        Введите название издательства: Эксмо
        Введите количество страниц: 384
        Введите жанр книги: Роман
        Введите год издания: 1967
        Введите себестоимость книги: 8.50
        Введите цену для продажи: 15.99
        Является ли книга продолжением? (да/нет): нет

        Книга успешно добавлена!

        1. Добавить книгу
        2. Удалить книгу
        3. Редактировать книгу
        4. Продать книгу
        5. Списать книгу
        6. Внести книгу в акцию
        7. Отложить книгу для покупателя
        8. Поиск книги
        9. Просмотреть список новинок
        10. Просмотреть список самых продаваемых книг
        11. Просмотреть список популярных авторов
        12. Просмотреть список популярных жанров
        0. Выход

        Выберите действие: 8

        ======= Поиск книги =======

        Выберите параметр поиска:
        1. По названию книги
        2. По автору
        3. По жанру

        Введите номер параметра: 2
        Введите ФИО автора: Михаил Булгаков

        Результаты поиска:
        1. Мастер и Маргарита - Михаил Булгаков, Эксмо

        1. Добавить книгу
        2. Удалить книгу
        3. Редактировать книгу
        4. Продать книгу
        5. Списать книгу
        6. Внести книгу в акцию
        7. Отложить книгу для покупателя
        8. Поиск книги
        9. Просмотреть список новинок
        10. Просмотреть список самых продаваемых книг
        11. Просмотреть список популярных авторов
        12. Просмотреть список популярных жанров
        0. Выход

        Выберите действие: 0

        Выход из приложения. Спасибо за использование!
 */